//=====================================
//
// リザルトヘッダー
// Author : Sato Teruto
//
//=====================================
#ifndef _RESULT_H_
#define _RESULT_H_	

//--------------------
// インクルード
//--------------------
#include <d3dx9.h>

//-----------------------
// 前方宣言
//-----------------------
class CBg;			//背景

//-------------------------
// リザルトクラスの定義
//-------------------------
class CResult
{
public:
	CResult();	//コンストラクタ
	~CResult();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

	//------------------
	// 静的メンバ関数
	//------------------
	static CBg	*GetBG();	//背景の取得

private:
	//------------------
	// 静的メンバ変数
	//------------------
	static CBg	*m_pBG;	//背景クラス
};

#endif